[
  {
    "number": "1",
    "keyword": "výletníci",
    "text": "35 výletníkov sa pred cestou rozdelilo na štyri skupiny: 17 sa ich vracalo vlakom, 8 autobusom, 6 lodí a 4 pešo. Koľkými spôsobmi sa mohli rozdeliť?",
    "hint": "",
    "result": ""
  },
  {
    "number": "2",
    "keyword": "abeceda",
    "text": "Latinská abeceda sa skladá z 26 písmen. Koľko 6-písmenových slov z nej možno utvoriť?",
    "hint": "",
    "result": ""
  },
  {
    "number": "3",
    "keyword": "menu",
    "text": "Na jedálnom lístku sú 4 aperitívy, 6 predjedál, 3 polievky, 23 hlavných jedál, 4 studené nápoje, 5 múčnikov, 2 teplé nápoje a 12 vín. Koľkými spôsobmi je možné zostaviť menu skladajúce sa zo všetkých ôsmich súčastí?",
    "hint": "",
    "result": ""
  },
  {
    "number": "4",
    "keyword": "zápasy",
    "text": "V stávke sa tipujú výsledky 12 zápasov - či vyhrajú domáci, hostia alebo zápasy skončia nerozhodne. Koľko je všetkých možných tipov ?",
    "hint": "",
    "result": ""
  },
  {
    "number": "5",
    "keyword": "zoradenie vagónov",
    "text": "Na zoraďovacej stanici stojí 5 lôžkových, 7 jedálnych a 20 obyčajných osobných vagónov. Bude z nich zostavená súprava s piatimi vagónmi. Koľko rôznych súprav je možno zoradiť?",
    "hint": "",
    "result": ""
  },
  {
    "number": "6",
    "keyword": "lokomotíva",
    "text": "Koľko rôznych slov, v ktorých nie sú žiadne dve písmená o vedľa seba, je možné získať zámenou poradia písmen v slove lokomotíva ?",
    "hint": "",
    "result": ""
  },
  {
    "number": "7",
    "keyword": "výber kariet",
    "text": "Koľkými spôsobmi sa dá z kartovej hry (po ôsmich kartách štyroch farieb) vybrať 6 kariet tak, aby medzi nimi boli karty všetkých štyroch farieb?",
    "hint": "",
    "result": ""
  },
  {
    "number": "8",
    "keyword": "volejbalové družstvá",
    "text": "Koľkými spôsobmi je možné rozdeliť 8 chlapcov a 4 dievčatá na dve šesťčlenné volejbalové družstvá tak, aby v každom družstve bolo aspoň jedno dievča?",
    "hint": "",
    "result": ""
  }
]